stratus9/Rejestrator-PTR/Project/STM8S_StdPeriph_Template/main.c
/**
  ******************************************************************************
  * @file    Project/main.c 
  * @author  MCD Application Team
  * @version V2.2.0
  * @date    30-September-2014
  * @brief   Main program body
   ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT 2014 STMicroelectronics</center></h2>
  *
  * Licensed under MCD-ST Liberty SW License Agreement V2, (the "License");
  * You may not use this file except in compliance with the License.
  * You may obtain a copy of the License at:
  *
  *        http://www.st.com/software_license_agreement_liberty_v2
  *
  * Unless required by applicable law or agreed to in writing, software 
  * distributed under the License is distributed on an "AS IS" BASIS, 
  * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
  * See the License for the specific language governing permissions and
  * limitations under the License.
  *
  ******************************************************************************
  */ 


/* Includes ------------------------------------------------------------------*/
#include "stm8s.h"
#include "main.h"
#include "fonts.h"
#include <math.h>
#include <stdlib.h>
#include <stdint.h>

/* Private defines -----------------------------------------------------------*/

/* Private var ---------------------------------------------------------------*/
OLED_t OLED_buffer;
sensors_t Sensors;
bmp_t BMP;
volatile uint8_t beep = 0;
volatile uint8_t beep_trigger = 0;
//FLASH_pageStruct_t FLASH_pageStruct_d;

/* Private functions ---------------------------------------------------------*/


void main(void)
{
  //while(1){}
  //----------------Select fCPU = 16MHz--------------------------//
  CLK_SYSCLKConfig(CLK_PRESCALER_HSIDIV1);      //118 B
  
  //----------------------Init UART------------------------------//
  //USART_Initialization();       //1182 B -> 85 B
  
  //------------------------Init I2C-----------------------------//
  I2C_Initialization();       //605 B
  
  //-----------------------Init GPIO-----------------------------//
  GPIO_Initialization();        //263 B -> 57 B
  
  //-----------------------Init SPI------------------------------//
  //SPI_Initialization();        //
   
  //----------------------Init Timers---------------------------//
  //Delay(10000);
  //Timer1_Init();              //716 B
  Timer2_Init();                //209 B
  enableInterrupts();           
  
  //----------------------Init Buzzer---------------------------//
  // Beep_Start();
  // Beep_Stop();
  Beep_Initialization();      //130 B
  
  //0x3A - ADXL345 (0x1D<<1); 0xEE - BMP280 (0x77<<1);  0x3C<<1 - OLED
  OLED_Init();                  //169 B
  ADXL_init();                  //37 B
  BMP_init(&BMP);               //241 B
  LED_GREEN(0);
  
  OLED_Clear(&OLED_buffer, 0);  //64B 
  OLED_paramTemplate(&OLED_buffer);
  OLED_RefreshRAM(&OLED_buffer);        //6 B
  
  
  //FLASH_PowerUp();
  
  BMP_read(&BMP);       //430 B
  BMP.max_pressure = BMP.press;
  BMP.min_pressure = BMP.press;
  BMP.max_altitude = 0;
  
  uint8_t framecount = 0;
  while (1){
   ADXL_read(&Sensors); //87 B
   BMP_read(&BMP);       //430 B
   LED_BLUE(1);
   if(BMP.max_pressure < BMP.press) BMP.max_pressure = BMP.press;
   if(BMP.min_pressure > BMP.press) BMP.min_pressure = BMP.press;
   
   BMP.altitude = (int32_t)BMP_altitude(BMP.min_pressure, BMP.max_pressure);
   if(BMP.max_altitude < BMP.altitude) BMP.max_altitude = BMP.altitude;
   
   if((BMP.max_altitude > 50) && (BMP.altitude < 20)) beep_trigger = 1;
   else beep_trigger = 0;
   
   if(Sensors.max_acc < Sensors.accY) Sensors.max_acc = Sensors.accY;
   
   framecount++;
   if(framecount > 4){
     framecount = 0;
     OLED_dispVelocity(&OLED_buffer, 0);
     OLED_dispAcceleration(&OLED_buffer, labs((int32_t)Sensors.max_acc*4));
     OLED_dispAltitude(&OLED_buffer, labs(BMP.max_altitude));
     //OLED_dispAltitude(&OLED_buffer, abs(Sensors.accZ)*1000UL/256);
    
     OLED_RefreshRAM(&OLED_buffer);
   }

   Delay(1000);       //11 B
   LED_BLUE(0);
   Delay(2000);    //3 B
  }
}

/**
  * @brief  Delay.
  * @param  nCount
  * @retval None
  */
void Delay(uint32_t nCount)
{
    /* Decrement nCount value */
    while (nCount != 0)
    {
        nCount--;
    }
}


//======================================================================================
//                              GPIO
//======================================================================================

void GPIO_Initialization(void){
  /*
  GPIO_Init(GPIOD, (GPIO_Pin_TypeDef)GPIO_PIN_2, GPIO_MODE_OUT_PP_HIGH_FAST);   //Si4463 CS   //13 B
  GPIO_WriteHigh (GPIOD, GPIO_PIN_2);         //9 B
  
  GPIO_Init(GPIOC, (GPIO_Pin_TypeDef)GPIO_PIN_3, GPIO_MODE_OUT_PP_HIGH_FAST);   //13 B
  
  GPIO_Init(GPIOD, (GPIO_Pin_TypeDef)GPIO_PIN_4, GPIO_MODE_OUT_PP_HIGH_FAST);   //13 B
  GPIO_WriteHigh (GPIOD, GPIO_PIN_4);           //9 B
  */
  GPIO_Init_Fast();   //57 B
}

void GPIO_Init_Fast(){
  //PC3 - LED1
  GPIOC->CR2 &= ~0x08;  //slow slope 2MHz
  GPIOC->DDR &= ~0x08;  //Input
  
  //PA1 - LED2
  GPIOA->CR2 &= ~0x02;  //slow slope 2MHz
  GPIOA->DDR &= ~0x02;  //Intput
  
  //PA2 - LED3  - wada w PCB v1.0; W wersji v1.0 zworka z +3V3
  //GPIOA->CR2 &= ~0x04;  //slow slope 2MHz
  //GPIOA->DDR |= 0x04;   //Output
  //GPIOA->CR1 |= 0x04;   //Push-Pull
  
  //PC4 - I2C Pull-up
  GPIOC->CR2 &= ~0x10;  //slow slope 2MHz
  GPIOC->DDR |= 0x10;   //Output
  GPIOC->CR1 |= 0x10;   //Push-Pull
  GPIOC->ODR |= 0x10;   //Enable I2C Pull-up
  
  //PD2 - LCD RES#
  GPIOD->CR2 &= ~0x04;  //slow slope 2MHz
  GPIOD->DDR |= 0x04;   //Output
  GPIOD->CR1 |= 0x04;   //Push-Pull
  GPIOD->ODR |= 0x04;   //Enable I2C Pull-up
}

//=======================================================================================
//                              UART
//=======================================================================================
void USART_Initialization(void){
  UART1_DeInit_Fast();     //47 B
  
  //UART1_Init((uint32_t)115200, UART1_WORDLENGTH_8D, UART1_STOPBITS_1, UART1_PARITY_NO, UART1_SYNCMODE_CLOCK_DISABLE, UART1_MODE_TXRX_ENABLE); //1163 B
  UART1_Init_Fast();    //29 B
  UART1_ENABLE();       //19 B -> 9 B
}

void UART1_Init_Fast(){
  #define UART1_baud 115200
  #define UART1_BBR1 0x08
  #define UART1_BBR2 0x0B

  UART1->CR1 = 0x00;           //set 8-bit word length, no parity, UART enabled (change for low power)
  UART1->CR3 = 0x00;           //set 1 bit Stop

  UART1->BRR1 = UART1_BBR1; 
  UART1->BRR2 = UART1_BBR2;       
   
