stratus9/Rejestrator-PTR/Project/STM8S_StdPeriph_Template/main.c
  UART1->CR2 |= 0x08 | 0x04;    //RX i TX enabled
}

void UART1_DeInit_Fast(){
  /* Clear the Idle Line Detected bit in the status register by a read
  to the UART1_SR register followed by a Read to the UART1_DR register */
  
  (void)UART1->SR;    //3B
  (void)UART1->DR;    //3B
  
  UART1->BRR2 = 0x00;  // Set UART1_BRR2 to reset value 0x00    //4B
  UART1->BRR1 = 0x00;  // Set UART1_BRR1 to reset value 0x00    //4B
  
  UART1->CR1 = 0x00;  // Set UART1_CR1 to reset value 0x00    //4B
  UART1->CR2 = 0x00;  // Set UART1_CR2 to reset value 0x00    //4B
  UART1->CR3 = 0x00;  // Set UART1_CR3 to reset value 0x00    //4B
  UART1->CR4 = 0x00;  // Set UART1_CR4 to reset value 0x00    //4B
  UART1->CR5 = 0x00;  // Set UART1_CR5 to reset value 0x00    //4B
  
  UART1->GTR = 0x00;    //4B
  UART1->PSCR = 0x00;   //4B
}

void UART1_ENABLE(){
    /* UART1 Enable */
    UART1->CR1 &= (~0x20); 
}

void USART_SendString(char * value){
  while(*value){
    while (UART1_GetFlagStatus(UART1_FLAG_TXE) == RESET){}
    UART1_SendData8(*value++);
  }
}

void USART_SendChar(char value){
  while (UART1_GetFlagStatus(UART1_FLAG_TXE) == RESET){}
  UART1_SendData8(value);
}

//==========================================================================================================
//                              SPI
//==========================================================================================================
void SPI_Initialization(){
  SPI_DeInit();       //25 B
  SPI->CR1 = 0x28 | 0x04;      //MSB first, x64 prescaler, polarity Low, Master
  SPI->CR2 = 0x02 | 0x01;      //Full duplex, Software slave management enabled, Master
  /* SPI Enable */
  SPI_Cmd(ENABLE);    //29 B
}

inline void SPI_wait(){
  while (SPI_GetFlagStatus(SPI_FLAG_TXE)== RESET){}  
}

void SPI_sendByte(uint8_t value){
  //SPI_wait();
  while (!(SPI->SR & SPI_FLAG_TXE)){} 
  SPI->DR = value;
}

uint8_t SPI_ReadByte(){
  uint8_t Data = 0;

  /* Wait until the transmit buffer is empty */
  while (SPI_GetFlagStatus(SPI_FLAG_TXE) == RESET);
  /* Send the byte */
  SPI_SendData(0x00);

  /* Wait until a data is received */
  while (SPI_GetFlagStatus(SPI_FLAG_BSY)== SET);
  while (SPI_GetFlagStatus(SPI_FLAG_RXNE) == RESET);
  /* Get the received data */
  Data = SPI_ReceiveData();

  /* Return the shifted data */
  return Data;
}

uint8_t SPI_RWByte(uint8_t value){
  uint8_t Data = 0;

  /* Wait until the transmit buffer is empty */
  while (SPI_GetFlagStatus(SPI_FLAG_TXE)== RESET){}
  /* Send the byte */
  SPI_SendData(value);
  while (SPI_GetFlagStatus(SPI_FLAG_RXNE) == RESET);
  Data = SPI_ReceiveData();
  
  SPI_ClearRXBuffer();
  /* Return the shifted data */
  return Data;
}

void SPI_ClearRXBuffer(){
  while (SPI_GetFlagStatus(SPI_FLAG_RXNE) == SET){
    SPI_ReceiveData();
  }
}

void FLASH_PowerUp(){
  FLASH_CS(1);
  SPI_RWByte(0xAB);
  FLASH_CS(0);
}

uint16_t FLASH_ReadID(){
	FLASH_CS(1);
	SPI_RWByte(0x90);
	SPI_RWByte(0x00);
	SPI_RWByte(0x00);
	SPI_RWByte(0x00);
	uint16_t tmp = SPI_RWByte(0) << 8;
	tmp |= SPI_RWByte(0);
	FLASH_CS(0);
	return tmp;
}

void FLASH_CS(uint8_t value) {
  if(value){
    GPIOA->DDR |= 0x08;   //Output
    GPIOA->CR1 |= 0x08;   //Push-Pull
    GPIOA->ODR &= ~0x08;
  }
  else{
     GPIOA->DDR |= 0x08;   //Output
    GPIOA->CR1 |= 0x08;   //Push-Pull
    GPIOA->ODR |= 0x08;
  }
}

void FLASH_1byteCommand(uint8_t value){
	FLASH_CS(1);
	SPI_RWByte(value);
	FLASH_CS(0);
}

void FLASH_WriteEnable(uint8_t value){
	if(value) FLASH_1byteCommand(0x06);
	else FLASH_1byteCommand(0x04);
}

void FLASH_arrayRead(uint32_t address, uint8_t * array, uint32_t length){
	FLASH_waitForReady();
	FLASH_CS(1);
	SPI_RWByte(0x03);	//READ
	SPI_RWByte((address>>16) & 0xFF);
	SPI_RWByte((address>>8) & 0xFF);
	SPI_RWByte(address & 0xFF);
	for (uint32_t i=0; i<length; i++){
		array[i] = SPI_RWByte(0);
	}
	FLASH_CS(0);
}

void FLASH_waitForReady(void){
	while(FLASH_status() & 0x01) Delay(1000);
}

uint8_t FLASH_status(void){
	FLASH_CS(1);
	SPI_RWByte(0x05);	//READ
	uint8_t stat = SPI_RWByte(0);
	FLASH_CS(0);
	return stat;
}

void FLASH_pageWrite(uint32_t page, uint8_t * array, uint16_t length){  //strona ma 256B
	uint32_t address = page<<8;
	FLASH_waitForReady();
	FLASH_WriteEnable(1);
	FLASH_CS(1);
	SPI_RWByte(0x02);	//Page program
	SPI_RWByte((address>>16) & 0xFF);
	SPI_RWByte((address>>8) & 0xFF);
	SPI_RWByte(address & 0xFF);
	for(uint16_t i = 0; i < length; i++){
		SPI_RWByte(*array++);
	}
	FLASH_CS(0);
}

//==========================================================================================================
//                              Timer
//==========================================================================================================

void Timer1_Init(){
  TIM1_DeInit();
  /* Time Base configuration */
  /*
  TIM1_Period = 4095
  TIM1_Prescaler = 0
  TIM1_CounterMode = TIM1_COUNTERMODE_UP
  TIM1_RepetitionCounter = 0
  */
  TIM1_TimeBaseInit(1032, TIM1_COUNTERMODE_UP, 6, 0);
  
  /*
  TIM1_OCMode = TIM1_OCMODE_PWM2
  TIM1_OutputState = TIM1_OUTPUTSTATE_ENABLE
  TIM1_OutputNState = TIM1_OUTPUTNSTATE_ENABLE
  TIM1_Pulse = CCR1_Val
  TIM1_OCPolarity = TIM1_OCPOLARITY_LOW
  TIM1_OCNPolarity = TIM1_OCNPOLARITY_HIGH
  TIM1_OCIdleState = TIM1_OCIDLESTATE_SET
  TIM1_OCNIdleState = TIM1_OCIDLESTATE_RESET
  */
  TIM1_OC3Init(TIM1_OCMODE_PWM1, 
               TIM1_OUTPUTSTATE_ENABLE, 
               TIM1_OUTPUTNSTATE_ENABLE,
               3,    //by³o 3
               TIM1_OCPOLARITY_LOW, 
               TIM1_OCNPOLARITY_HIGH, 
               TIM1_OCIDLESTATE_SET,
               TIM1_OCNIDLESTATE_RESET); 
  
  //TIM1_CCPreloadControl(ENABLE);
  TIM1_ITConfig(TIM1_IT_COM, DISABLE);

  /* TIM1 counter enable */
  TIM1_Cmd(ENABLE);
  
  /* TIM1 Main Output Enable */
  TIM1_CtrlPWMOutputs(ENABLE);
}

void Timer2_Init(){
  TIM2_DeInit();
  TIM2_TimeBaseInit(TIM2_PRESCALER_16384, 97);    //10 = X/(1024*6630) Fclk = 15.912.000 ~fcpu
  //TIM2_TimeBaseInit(TIM2_PRESCALER_16, 9945);    //~100Hz
  
  TIM2_ITConfig(TIM2_IT_UPDATE, ENABLE);

  /* TIM1 counter enable */
  TIM2_Cmd(ENABLE);
}

void Timer2_ISR(){    
  if(beep_trigger){
    beep++;
    if(beep > 20) beep = 0;
    if(beep == 4) Beep_Start();
    else Beep_Stop();
  }
}

//==========================================================================================================
//                              Buzzer
//==========================================================================================================

