stratus9/Rejestrator-PTR/Project/STM8S_StdPeriph_Template/main.c
inline void OLED_dispAltitude(OLED_t * OLED, uint32_t value){
  OLED_dispInt(OLED, 32, 21, value);
}

void OLED_drawLine(OLED_t * OLED, uint8_t x1, uint8_t y1, uint8_t x2, uint8_t y2, uint8_t mode){
  uint8_t tmp;
  uint8_t x,y;
  uint8_t dx, dy;
  int8_t err;
  int8_t ystep;
  
  uint8_t swapxy = 0;
  
  if ( x1 > x2 ) dx = x1-x2; else dx = x2-x1;
  if ( y1 > y2 ) dy = y1-y2; else dy = y2-y1;
  
  if ( dy > dx ) 
  {
    swapxy = 1;
    tmp = dx; dx =dy; dy = tmp;
    tmp = x1; x1 =y1; y1 = tmp;
    tmp = x2; x2 =y2; y2 = tmp;
  }
  if ( x1 > x2 ) 
  {
    tmp = x1; x1 =x2; x2 = tmp;
    tmp = y1; y1 =y2; y2 = tmp;
  }
  err = dx >> 1;
  if ( y2 > y1 ) ystep = 1; else ystep = -1;
  y = y1;
  
  if ( x2 == 255 ) x2--;
  
  for( x = x1; x <= x2; x++ ){
    if ( swapxy == 0 ) 
      OLED_DrawPoint(OLED, x, y, mode); 
    else 
      OLED_DrawPoint(OLED, y, x, mode); 
    err -= (uint8_t)dy;
    if ( err < 0 ){
      y += (uint8_t)ystep;
      err += (uint8_t)dx;
    }
  }
}

void OLED_drawPlotTemplate(OLED_t * OLED, char type){
  //----  X axis  ---------
  OLED_drawLine(OLED,  0, 29, 90, 29, 1);
  OLED_drawLine(OLED, 90, 29, 88, 27, 1);
  OLED_drawLine(OLED, 90, 29, 88, 31, 1);
  OLED_displayChar(OLED, 91, 20, 't', 12, 1);
    
  //---- Y axis  ----------
  OLED_drawLine(OLED, 2, 6, 2, 31, 1);
  OLED_drawLine(OLED, 2, 6, 0,  8, 1);
  OLED_drawLine(OLED, 2, 6, 4,  8, 1);
  OLED_displayChar(OLED, 4, 0, type, 12, 1);
}

void OLED_drawPlotData(OLED_t * OLED, dataset_t * data){
  
}

void datasetPrepare(dataset_t * data){
  
}

//==========================================================================================================
//                              Dev
//==========================================================================================================
void dev_CheckSensors(){
  OLED_Clear(&OLED_buffer, 0);
  
  if(I2C_ReadOneByte(0xEE, 0xD0) == 0x58) OLED_dispTxt(&OLED_buffer,0,0,"BMP  OK",12,1);
  else OLED_dispTxt(&OLED_buffer,0,0,"BMP  NOPE",12,1);
  
  if(I2C_ReadOneByte(0x3A, 0x00) == 0xE5) OLED_dispTxt(&OLED_buffer,0,12,"ADXL OK",12,1);
  else OLED_dispTxt(&OLED_buffer,0,12,"ADXL  NOPE",12,1);
  
  OLED_RefreshRAM(&OLED_buffer);
}

//==========================================================================================================
//                              BMP280
//==========================================================================================================
void BMP_init(bmp_t * BMP) {
  uint8_t buffer[25];
  I2C_ReadNByte(0xEE, 0x88, buffer, 24);
  BMP->T1 = buffer[0] | (buffer[1] << 8);
  BMP->T2 = buffer[2] | (buffer[3] << 8);
  BMP->T3 = buffer[4] | (buffer[5] << 8);
  BMP->P1 = buffer[6] | (buffer[7] << 8);
  BMP->P2 = buffer[8] | (buffer[9] << 8);
  BMP->P3 = buffer[10] |(buffer[11] << 8);
  BMP->P4 = buffer[12] | (buffer[13] << 8);
  BMP->P5 = buffer[14] | (buffer[15] << 8);
  BMP->P6 = buffer[16] | (buffer[17] << 8);
  BMP->P7 = buffer[18] | (buffer[19] << 8);
  BMP->P8 = buffer[20] | (buffer[21] << 8);
  BMP->P9 = buffer[22] | (buffer[23] << 8);
  
  /*
  BMP->T1 = 27504;      //buffer[0] | (buffer[1] << 8);
  BMP->T2 = 26435;      //buffer[2] | (buffer[3] << 8);
  BMP->T3 = -1000;      //buffer[4] | (buffer[5] << 8);
  BMP->P1 = 36477;      //buffer[6] | (buffer[7] << 8);
  BMP->P2 = -10685;     //buffer[8] | (buffer[9] << 8);
  BMP->P3 = 3024;       //buffer[10] |(buffer[11] << 8);
  BMP->P4 = 2855;       //buffer[12] | (buffer[13] << 8);
  BMP->P5 = 140;        //buffer[14] | (buffer[15] << 8);
  BMP->P6 = -7;         //buffer[16] | (buffer[17] << 8);
  BMP->P7 = 15500;      //buffer[18] | (buffer[19] << 8);
  BMP->P8 = -14600;     //buffer[20] | (buffer[21] << 8);
  BMP->P9 = 6000;       //buffer[22] | (buffer[23] << 8);
  */
  
  I2C_SendTwoBytes(0xEE, 0xF4, 0x3F);
}

void BMP_read(bmp_t * BMP) {
  uint8_t buffer[7];
  I2C_ReadNByte(0xEE, 0xF7, buffer, 6);
  
  BMP->UP = buffer[0];
  BMP->UP = BMP->UP << 8 | buffer[1];
  BMP->UP = BMP->UP << 8 | buffer[2];
  BMP->UP >>= 4;
  
  BMP->UT = buffer[3];
  BMP->UT = BMP->UT << 8 | buffer[4];
  BMP->UT = BMP->UT << 8 | buffer[5];
  BMP->UT >>= 4;
  
  //--------- Temp -------------
  int32_t var1, var2, tfine;
  var1  = ((((BMP->UT>>3) - ((int32_t)BMP->T1 <<1))) * ((int32_t)BMP->T2)) >> 11;
  var2  = (((((BMP->UT>>4) - ((int32_t)BMP->T1)) * ((BMP->UT>>4) - ((int32_t)BMP->T1))) >> 12) * ((int32_t)BMP->T3)) >> 14;
  
  tfine = var1 + var2;
  BMP->temp = (tfine)>>9;
  
  //--------- Press -----------
  float fvar1=0.0, fvar2=0.0, p=0.0;
  fvar1 = (float)tfine/2.0 - 64000.0;
  fvar2 = fvar1 * fvar1*((double)BMP->P6)/32768.0;
  fvar2 = fvar2 + fvar1*((float)BMP->P5)*2.0;
  fvar2 = (fvar2/4.0) + ((float)BMP->P4)*65536.0;
  fvar1 = (((float)BMP->P3) * fvar1 * fvar1/524288.0 + ((float)BMP->P2) * fvar1)/524288.0;
  fvar1 = (1.0 + fvar1/32768.0)*((float)BMP->P1);
  p = 1048576.0-((float)BMP->UP);
  p = (p-(fvar2/4096.0))*6250.0 / fvar1;
  fvar1 = ((float)BMP->P9)*p*p/2147483648.0;
  fvar2 = p*((float)BMP->P8)/32768.0;
  p = p + (fvar1 + fvar2+((float)BMP->P7))/16.0;
  BMP->press = (uint32_t)p;
}

float BMP_altitude(uint32_t startPress, uint32_t currPress){
   float x1, x2, x3, x4;
   //x1 = (1.0-powf(currPress/startPress, 0.1902632365))*43538.0;
   //x1 = 297.15/9.8*297.15*logf(startPress/currPress);
   x1 = (float)currPress/(float)startPress;
   x2 = -4863.0*x1*x1*x1;
   x3 =  16830.0*x1*x1;
   x4 = -27490.0*x1;
   return (x2 + x3 + x4 + 15520)*100.0;
}

//==========================================================================================================
//                              ADXL345
//==========================================================================================================
void ADXL_init(){
  I2C_SendTwoBytes(0x3A, 0x2D, 0x00);
  I2C_SendTwoBytes(0x3A, 0x2D, 0x10);
  I2C_SendTwoBytes(0x3A, 0x2D, 0x08);
  I2C_SendTwoBytes(0x3A, 0x31, 0x0B);   // +/- 16g Full ress
}

void ADXL_read(sensors_t * sensor){
  uint8_t buffer[7];
  I2C_ReadNByte(0x3A, 0x32, buffer, 6);
  sensor->accX = buffer[1]<<8 | buffer[0];
  sensor->accY = buffer[3]<<8 | buffer[2];
  sensor->accZ = buffer[5]<<8 | buffer[4];
}


#ifdef USE_FULL_ASSERT

/**
  * @brief  Reports the name of the source file and the source line number
  *   where the assert_param error has occurred.
  * @param file: pointer to the source file name
  * @param line: assert_param error line source number
  * @retval : None
  */
void assert_failed(u8* file, u32 line)
{ 
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */

  /* Infinite loop */
  while (1)
  {
  }
}
#endif


/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
